In [1]:
import pandas as pd

data = {
    'Name': ['Himanshu', 'Robert', 'Karie', 'Rohan', 'John'],
    'Age': [15, 14, 15, 16, 17],
    'Percentage': [80, 77, 83, 45, 70],
    'Stream': ['Commerce', 'Science', 'Arts', 'Commerce', 'Science']
}

df = pd.DataFrame(data)
df

       Name  Age  Percentage    Stream
0  Himanshu   15          80  Commerce
1    Robert   14          77   Science
2     Karie   15          83      Arts
3     Rohan   16          45  Commerce
4      John   17          70   Science

In [5]:
df1 = df.groupby(by='Stream')

In [8]:
mask1 = df['Percentage']>= 75

In [16]:
mask2 = (df.Stream == 'Commerce') | (df.Stream == 'Arts')

In [26]:
df1 = df[mask1 & mask2]
df1

       Name  Age  Percentage    Stream
0  Himanshu   15          80  Commerce
2     Karie   15          83      Arts

In [27]:
df1['Name']

0    Himanshu
2       Karie
Name: Name, dtype: object

In [24]:
options = ['Commerce' ,'Arts'] 
final_df = df[(df['Percentage'] >= 75) & df['Stream'].isin(options)]

In [25]:
final_df

       Name  Age  Percentage    Stream
0  Himanshu   15          80  Commerce
2     Karie   15          83      Arts